In [65]:
import pandas as pd
data1=pd.read_csv('id_home.csv',low_memory=False)
#data1=pd.read_csv('data_2.csv',low_memory=False)

In [66]:
data1.tail()

            id      dis_a       dis_b
299995  299996  32.637196 -117.190058
299996  299997  32.690949 -117.137111
299997  299998  32.612603 -117.133180
299998  299999  32.698175 -117.182970
299999  300000  32.652601 -117.142348

In [67]:
#str转为float
data1[['dis_a','dis_b']] = data1[['dis_a','dis_b']].astype("float")
print(data1.head())
print("--------"*10)
print(data1.dtypes)

   id      dis_a       dis_b
0   1  32.776858 -117.155046
1   2  32.774242 -117.170558
2   3  32.735363 -117.148283
3   4  32.781682 -117.172229
4   5  32.740891 -117.178473
--------------------------------------------------------------------------------
id         int64
dis_a    float64
dis_b    float64
dtype: object

In [68]:
#输入核心id
tid = 182448
ti = tid -1
list_id = data1['id'].tolist()
print(list_id[ti])
list_home_a = data1['dis_a'].tolist()
list_home_b = data1['dis_b'].tolist()
print(list_home_a[ti])
print(list_home_b[ti])

182448
32.719358
-117.08916799999999

In [81]:
#计算距离 id：220699	4022	lat：32.796537	lon：117.049412	corenode 2KM 范围内：3202 个节点
#核心  id
id = 10000
#
#
import math
from pandas.core.frame import DataFrame
dis_list_id_a = []
dis_list_id_b = []
dis_list_a_b = []
i = id -1
for j in range(0,len(list_id)):
    A = (float(list_home_a[i]) - float(list_home_a[j]))**2
    B = (float(list_home_b[i]) - float(list_home_b[j]))**2
    C = (A + B)**0.5*100

    dis_list_id_a.append(list_id[i])
    dis_list_id_b.append(list_id[j])
    dis_list_a_b.append(C)

        
        #print(list_id[i], list_id[j], C)
#print(dis_list_id_a,dis_list_id_b,dis_list_a_b)
dis_data={"id_a" : dis_list_id_a,
   "id_b" : dis_list_id_b,
   "dis_a_b" : dis_list_a_b } #将列表a，b转换成字典
data2=DataFrame(dis_data) #将字典转换成为数据框
print(data2.head())

    id_a  id_b   dis_a_b
0  10000     1  4.045760
1  10000     2  5.600781
2  10000     3  6.346473
3  10000     4  5.595587
4  10000     5  7.905187

In [82]:
#删除小于 2km 的节点
data3 = data2[['id_a','id_b','dis_a_b']][data2['dis_a_b'] <= 2.000]
print(data3.shape)

(3191, 3)

In [40]:
data4 = data3[['id_b','dis_a_b']]
data4.head()

   id_b    dis_a_b
0     1  10.745141
1     2  12.318044
2     3  11.626579
3     4  12.371211
4     5  14.054615

In [46]:
#data4.rename(columns={'id_b':'id'}, inplace = True)
data4.columns = ['id','dis_a_b']
data4.head()

   id    dis_a_b
0   1  10.745141
1   2  12.318044
2   3  11.626579
3   4  12.371211
4   5  14.054615

In [102]:
data1.head()

   id      dis_a       dis_b
0   1  32.776858 -117.155046
1   2  32.774242 -117.170558
2   3  32.735363 -117.148283
3   4  32.781682 -117.172229
4   5  32.740891 -117.178473

In [103]:
#与原始数据 data1 交叉合并 data3 , 左连接
import pandas as pd
data_m = pd.merge(data4, data1, on='id', how='left')
data_2 = data_m[['id','dis_a','dis_b']]

In [53]:
data_2.head()

   id      dis_a       dis_b
0   1  32.776858 -117.155046
1   2  32.774242 -117.170558
2   3  32.735363 -117.148283
3   4  32.781682 -117.172229
4   5  32.740891 -117.178473

In [55]:
data_2.columns = ['id','lat','lon']
data_2.to_csv('./data_2.csv',index = None,header = True,sep = ',' , encoding='utf-8')
print(1)

1

In [123]:
#随机
#计算距离 id：220699	4022	lat：32.796537	lon：117.049412	corenode 2KM 范围内：3202 个节点
#核心  id
#id = 10000
#
#
import math
from pandas.core.frame import DataFrame
listrnodea = []
listrnodeb = []
for i in range(0,5):
    dis_list_id_a = []
    dis_list_id_b = []
    dis_list_a_b = []
    id = i +1
    for j in range(0,len(list_id)):
        A = (float(list_home_a[i]) - float(list_home_a[j]))**2
        B = (float(list_home_b[i]) - float(list_home_b[j]))**2
        C = (A + B)**0.5*100

        dis_list_id_a.append(list_id[i])
        dis_list_id_b.append(list_id[j])
        dis_list_a_b.append(C)


            #print(list_id[i], list_id[j], C)
    #print(dis_list_id_a,dis_list_id_b,dis_list_a_b)
    dis_data={"id_a" : dis_list_id_a,
       "id_b" : dis_list_id_b,
       "dis_a_b" : dis_list_a_b } #将列表a，b转换成字典
    data2=DataFrame(dis_data) #将字典转换成为数据框
    #print(data2.head())
    #删除小于 2km 的节点
    data3 = data2[['id_a','id_b','dis_a_b']][data2['dis_a_b'] <= 2.000]
    print(id, len(data3['id_b']))
    #data3.drop(data3.index,inplace=True)
    listrnodea.append(id)
    listrnodeb.append(len(data3['id_b']))
                      
data5 = {"id" : listrnodea,
       "num" : listrnodeb} #将列表a，b转换成字典
datar = DataFrame(data5) #将字典转换成为数据框
#print(data2.head())
if len(datar['id']) == 1:
    datar[['id','num']].to_csv('./rannode1.csv',index = None,header = True,sep = ',' , encoding='utf-8')
    print(1)

1 2869
2 2592
3 3574
4 2412
5 2622